biddr_api/biddr_api/app/controllers/api/v1/auctions_controller.rb

SELECT "auctions".* FROM "auctions" ORDER BY "auctions"."created_at" DESC
---
    def index
        # curl http://localhost:3000/api/v1/auctions #👈🏻 on terminal
        # or
        # http://localhost:3000/api/v1/auctions # 👈🏻 on browser
        auction= Auction.order created_at: :desc

INSERT INTO "auctions" ("title", "description", "ends_at", "reserve_price", "created_at", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
    def create
        auction=Auction.new auction_params
        auction.user=current_user
        if auction.save